// 비트단위로 NOT 하여 출력하기
// 비트단위(bitwise) 연산자: ~(bitwise not), &(bitwise and), |(bitwise or), 
//                           ^(bitwise xor), <<(bitwise left shift), >>(bitwise right shift)
// 1이 입력되었을 때 저장되는 1을 32비트 2진수로 표현하면 00000000 00000000 00000000 00000001 
// ~1 -> 11111111 11111111 11111111 11111110 == -2
// int 형의 정수 0 == 00000000 00000000 00000000 00000000
// -1 == 0에서 1을 더 빼고 32비트만 표시하는 형태, 11111111 11111111 11111111 11111111

// int 형 변수: 최소 -2147483648 (10000000 00000000 00000000 00000000) ~ 최대 +2147483647 (01111111 11111111 11111111 11111111)
// -2147483648 (10000000 00000000 00000000 00000000) 에서 1을 더 뺀다면? 01111111 11111111 11111111 11111111, -2147483649 가 아닌 +2147483647
// 이러한 것을 오버플로우(overflow, 넘침)

// ~n = -n - 1
// -n = ~n + 1
#include <stdio.h>

int main()
{
	int a;
	scanf("%d", &a);
	printf("%d", ~a);
	return 0;
}
